"""
navbar
    *у кандидата
        - профиль ( ФИО
                    желаемая вакансия (можно выбрать исходя из рекомендации системы по вакансиям)
                    видеокарточки кандидата ( больше карточек => лучше точность ); описание кандидата будет соответстовать mean card vector )
        - подходящие вакансии (с учетом выбранных в профиле предпочтений)

*у рекрутера/работодателя
                    (у каждой вакансии в нашем списке есть hint = тип личности, но можно и вручную)
    - открытые вакансии (с возможностью добавления и удаления вакансий) (допустим 70, на презе сказать ебать можно расширить и тд)
    - рекомендованные кандидаты с radar chart(1, 5) (можно попробовать вытянуть какие-то качества)  
    страница кандидата с radar chart для работодателя
    !!!!!! (всплывающее окно с подтверждением удаления видео)
"""