# Copyright (c) 2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "ensemble_model"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [-1,3,448, 448]
  }
]
input [
  {
    name: "input_audio"
    data_type: TYPE_FP32
    dims: [1,-1]
    reshape: {[1,-1]}
  }
]

output[
{
name: "video_embendings"
data_type: TYPE_FP32
dims: [-1,768]
}
]

output[
{
name: "audio_embendings"
data_type: TYPE_FP32
dims: [-1,192]
}
]


output[
{
name: "text_embendings"
data_type: TYPE_FP32
dims: [-1,768]
}
]

ensemble_scheduling {
  step [
    {
      model_name: "audio_model"
      model_version: -1
      input_map {
        key: "audio_model_input"
        value: "input_audio"
      }
      output_map {
        key: "audio_emb_output"
        value: "audio_embendings"
      }
    },
    {
      model_name: "image_model"
      model_version: -1
      input_map {
        key: "image_model_input"
        value: "input_image"
      }
      output_map {
        key:"image_emb_output"
        value: "video_embendings"
      },
    },
    {
      model_name: "text_model"
      model_version: -1
      input_map {
        key: "input_text"
        value: "input_text"
      }
      output_map {
        key: "text_output"
        value: "text_embendings"
      }
    }
  ]
}
